app/views/posts/show.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."post_id" = $1  [["post_id", 1]]
---
        <div class="col-lg-8 col-lg-push-2 col-md-6 col-md-push-3 pic-container">
          <% if @post.pictures.length % 4 == 0 %>