app/controllers/posts_controller.rb

  def index
    @posts = Post.all.reverse
    @upcomingposts = Post.where("date >= ?", Date.today)
---
SELECT "posts".* FROM "posts" WHERE (date >= '2016-10-01 00:00:00' AND date <= '2016-10-31 23:59:59.999999')
SELECT "posts".* FROM "posts" WHERE "posts"."date" = $1  [["date", Mon, 25 Jul 2016 15:49:51 -0500]]

  def upcoming
    @posts = Post.where("date >= ?", Date.today).reverse
---
SELECT "posts".* FROM "posts" WHERE (date >= '2016-07-27')

  def past
    @posts = Post.where("date <= ?", Date.today).reverse
---
SELECT "posts".* FROM "posts" WHERE (date <= '2016-07-27')

  def create
    @post = Post.new(post_params)
    @post.document = params[:post][:document]
    if @post.save
      if params[:images]
        params[:images].each { |image|
          @post.pictures.create(image: image)
---
INSERT INTO "posts" ("title", "description", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fads"], ["description", "ggggg"], ["date", Wed, 20 Jul 2016], ["created_at", 2016-07-25 18:50:48 UTC], ["updated_at", 2016-07-25 18:50:48 UTC]]
INSERT INTO "pictures" ("post_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @post = Post.find(params[:id])
    if params[:post][:document]
      @post.document = params[:post][:document]
    end
    if @post.update(post_params)
      if params[:images]
        @post.pictures.destroy_all
        params[:images].each { |image|
          @post.pictures.create(image: image)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "document_file_name" = $1, "document_content_type" = $2, "document_file_size" = $3, "document_updated_at" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["document_file_name", nil], ["document_content_type", nil], ["document_file_size", nil], ["document_updated_at", nil], ["updated_at", 2016-07-29 18:31:18 UTC], ["id", 11]]
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 38]]
INSERT INTO "pictures" ("post_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"