app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(name: params[:user][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Steven"], ["LIMIT", 1]]